## Production: sns_to_sqs_sms_callbacks
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.lambda-image-sns-delivery-receipts-errors-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "lambda-image-sns-delivery-receipts-errors-critical" {
        id                        = "lambda-image-sns-delivery-receipts-errors-critical"
        tags                      = {}
      ~ treat_missing_data        = "missing" -> "notBreaching"
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.lambda-image-sns-delivery-receipts-errors-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda-image-sns-delivery-receipts-errors-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "5 errors on Lambda sns-to-sqs-sms-callbacks in 10 minutes"
      + alarm_name                            = "lambda-image-sns-delivery-receipts-errors-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "sns_to_sqs_sms_callbacks"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ]
      + period                                = 600
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "notBreaching"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>